/* 超级次方.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
你的任务是计算 ab 对 1337 取模，a 是一个正整数，b 是一个非常大的正整数且会以数组形式给出。

 

示例 1：

输入：a = 2, b = [3]
输出：8
示例 2：

输入：a = 2, b = [1,0]
输出：1024
示例 3：

输入：a = 1, b = [4,3,3,8,5,2]
输出：1
示例 4：

输入：a = 2147483647, b = [2,0,0]
输出：1198
 

提示：

1 <= a <= 231 - 1
1 <= b.length <= 2000
0 <= b[i] <= 9
b 不含前导 0

来源：力扣（LeetCode）
链接：https://leetcode-cn.com/problems/super-pow
著作权归领扣网络所有。商业转载请联系官方授权，非商业转载请注明出处。
*/

#include <iostream>
#include <stack>
#include "../check/CheckResult.h"

using namespace std;

class Solution {
public:
    int superPow(int a, vector<int>& b) {
        int i, size = b.size(), mod = 1337, result = fastPower(a, b[0], mod);

        for (i = 1; i < size; ++i) {
            result = fastPower(result, 10, mod) * fastPower(a, b[i], mod) % mod;
        }

        return result;
    }

    int fastPower(int a, int b, int mod) {
        int result = 1;
        a %= mod;

        while (b > 0) {
            if ((b & 1) == 1) {
                result = (result * a) % mod;
            }

            a = (a * a) % mod;
            b >>= 1;
        }

        return result;
    }
};

int main()
{
    CheckResult check;
    Solution o;

    check.checkInt(2, o.fastPower(2, 1, 1337));
    check.checkInt(4, o.fastPower(2, 2, 1337));
    check.checkInt(8, o.fastPower(2, 3, 1337));
    check.checkInt(16, o.fastPower(2, 4, 1337));
    check.checkInt(3, o.fastPower(3, 1, 1337));
    check.checkInt(9, o.fastPower(3, 2, 1337));
    check.checkInt(27, o.fastPower(3, 3, 1337));
    check.checkInt(81, o.fastPower(3, 4, 1337));
    check.checkInt(1, o.fastPower(1, 1, 1337));
    check.checkInt(1, o.fastPower(1, 2, 1337));
    check.checkInt(1, o.fastPower(1, 3, 1337));
    check.checkInt(1, o.fastPower(1, 4, 1337));
    check.checkInt(0, o.fastPower(0, 1, 1337));
    check.checkInt(0, o.fastPower(0, 2, 1337));
    check.checkInt(0, o.fastPower(0, 3, 1337));
    check.checkInt(0, o.fastPower(0, 4, 1337));

    vector<int> b = { 3 };
    check.checkInt(8, o.superPow(2, b));

    b = { 1,0 };
    check.checkInt(1024, o.superPow(2, b));

    b = { 4,3,3,8,5,2 };
    check.checkInt(1, o.superPow(1, b));

    b = { 2,0,0 };
    check.checkInt(1198, o.superPow(2147483647, b));

    b = { 3,0,3,9,7,2,2,0,4,3,8,2,5,8,6,8,3,3,9,2,6,5,7,2,8,3,0,4,6,7,7,8,0,2,7,7,4,2,8,1,7,6,5,4,6,1,2,2,4,3,4,2,8,1,5,9,5,7,3,3,5,2,1,5,5,1,4,1,3,2,2,2,1,7,7,7,0,9,9,6,5,3,9,5,7,4,4,2,3,0,5,8,2,8,5,7,9,2,9,4,4,3,7,7,3,4,5,3,5,6,2,0,2,1,6,9,7,2,3,0,2,0,1,5,8,8,4,0,0,3,4,7,7,3,4,0,9,1,5,5,8,7,7,0,0,3,1,9,8,6,0,0,6,3,7,6,3,2,6,4,5,3,1,4,8,7,4,8,9,2,5,7,9,2,9,0,8,2,9,6,8,1,6,4,6,4,2,0,6,1,4,3,6,7,8,4,4,4,2,3,6,7,2,6,2,1,8,0,3,9,6,3,3,4,7,9,8,2,9,6,3,5,2,9,4,0,3,9,6,8,4,3,7,7,1,9,0,9,9,6,0,5,9,3,2,9,3,0,1,4,9,4,0,1,3,4,3,8,5,9,8,2,2,6,9,5,5,1,6,7,7,7,4,7,0,6,8,5,9,9,2,0,3,2,1,8,8,6,6,6,5,7,8,0,3,9,5,0,0,2,7,0,1,2,9,3,0,7,9,9,6,1,9,1,5,2,9,5,8,7,1,6,4,1,6,7,0,3,0,3,7,7,3,8,1,2,2,2,9,3,1,5,6,3,6,1,5,7,8,4,4,2,0,1,3,8,0,6,3,0,9,1,0,2,1,1,6,3,3,5,8,7,2,4,0,0,7,7,7,6,3,3,8,5,6,3,3,7,9,9,9,8,0,9,2,1,1,8,7,6,3,7,3,7,2,5,7,1,5,4,7,8,0,7,4,6,1,9,5,0,8,5,1,0,4,3,4,7,2,1,4,7,0,9,5,4,7,2,6,2,9,3,0,9,3,4,7,4,6,3,6,4,0,7,5,4,1,9,2,5,2,8,2,4,7,7,9,4,2,5,6,1,0,9,2,3,3,1,9,1,6,6,6,6,3,3,1,6,4,5,3,8,3,6,2,2,5,1,7,9,6,5,2,7,4,4,2,0,8,2,1,4,8,9,3,3,2,6,2,8,1,5,6,6,3,9,8,9,0,7,8,9,3,1,8,7,7,0,9,7,2,1,4,2,0,7,8,5,3,0,3,6,7,0,2,1,1,2,0,1,0,0,2,5,3,0,4,3,1,4,0,5,7,6,0,7,3,0,4,8,0,0,4,9,2,8,0,3,3,0,6,3,3,9,0,8,1,4,1,4,8,4,2,5,0,2,5,4,4,1,4,6,1,9,5,3,9,6,8,2,8,5,7,1,6,7,0,7,2,3,2,2,7,4,0,0,8,5,6,2,8,0,8,0,9,3,5,1,1,4,3,0,1,1,3,7,0,5,4,2,9,8,7,8,2,7,8,2,4,4,4,2,5,4,2,6,0,0,9,1,4,3,1,5,6,7,4,8,2,8,3,1,7,0,2,1,7,0,4,1,7,0,3,4,5,8,2,7,8,2,8,4,7,2,1,5,9,5,3,1,5,6,5,4,6,7,6,5,9,2,6,6,2,2,0,9,0,3,6,0,7,7,6,4,9,9,9,0,6,2,3,1,9,0,6,7,7,4,3,9,6,1,5,8,3,8,0,5,3,6,7,0,3,3,4,4,4,3,6,0,5,0,4,6,0,2,4,0,6,9,9,4,0,6,4,4,4,4,9,7,3,9,7,8,4,3,3,9,6,9,1,4,1,5,0,4,7,6,6,5,5,5,9,6,3,6,2,8,0,3,7,3,2,7,2,7,0,7,6,7,8,7,1,2,5,3,6,4,0,2,0,7,9,1,3,2,7,7,2,0,1,0,5,3,9,9,0,9,8,8,8,9,8,1,1,5,5,9,9,7,3,1,6,2,5,2,6,4,9,9,4,0,1,2,4,2,1,6,1,2,7,0,1,5,1,2,0,8,3,1,7,6,3,4,8,8,6,6,2,5,7,9,6,8,1,2,2,4,8,4,6,5,6,9,2,9,3,4,8,6,6,7,2,9,1,0,7,7,9,1,5,6,0,3,7,1,5,9,8,5,3,6,1,1,6,5,1,9,0,1,6,6,8,0,5,2,1,4,1,2,7,6,8,8,9,5,1,6,5,9,2,0,8,3,2,4,0,5,5,0,6 };
    check.checkInt(1113, o.superPow(195412, b));
}

// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门使用技巧: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
