/* 检查是否有合法括号字符串路径.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
一个括号字符串是一个 非空 且只包含 '(' 和 ')' 的字符串。如果下面 任意 条件为 真 ，那么这个括号字符串就是 合法的 。

字符串是 () 。
字符串可以表示为 AB（A 连接 B），A 和 B 都是合法括号序列。
字符串可以表示为 (A) ，其中 A 是合法括号序列。
给你一个 m x n 的括号网格图矩阵 grid 。网格图中一个 合法括号路径 是满足以下所有条件的一条路径：

路径开始于左上角格子 (0, 0) 。
路径结束于右下角格子 (m - 1, n - 1) 。
路径每次只会向 下 或者向 右 移动。
路径经过的格子组成的括号字符串是 合法 的。
如果网格图中存在一条 合法括号路径 ，请返回 true ，否则返回 false 。

 

示例 1：



输入：grid = [["(","(","("],[")","(",")"],["(","(",")"],["(","(",")"]]
输出：true
解释：上图展示了两条路径，它们都是合法括号字符串路径。
第一条路径得到的合法字符串是 "()(())" 。
第二条路径得到的合法字符串是 "((()))" 。
注意可能有其他的合法括号字符串路径。
示例 2：



输入：grid = [[")",")"],["(","("]]
输出：false
解释：两条可行路径分别得到 "))(" 和 ")((" 。由于它们都不是合法括号字符串，我们返回 false 。
 

提示：

m == grid.length
n == grid[i].length
1 <= m, n <= 100
grid[i][j] 要么是 '(' ，要么是 ')' 。

来源：力扣（LeetCode）
链接：https://leetcode-cn.com/problems/check-if-there-is-a-valid-parentheses-string-path
著作权归领扣网络所有。商业转载请联系官方授权，非商业转载请注明出处。
*/

#include <iostream>
#include <unordered_set>
#include "../check/CheckResult.h"

using namespace std;

class Solution {
public:
    bool hasValidPath(vector<vector<char>>& grid) {
        int m = grid.size(), n = grid[0].size(), i, j;

        if (((m + n) % 2 == 0) || grid[0][0] == ')' || grid[m - 1][n - 1] == '(') {
            return false;
        }

        vector<unordered_set<int>> counts(m * n);
        counts[0].insert(1);

        for (i = 1; i < m; ++i) {
            dp(counts[(i - 1) * n], counts[i * n], grid[i][0]);
        }

        for (j = 1; j < n; ++j) {
            dp(counts[j - 1], counts[j], grid[0][j]);
        }

        for (i = 1; i < m; ++i) {
            for (j = 1; j < n; ++j) {
                dp(counts[(i - 1) * n + j], counts[i * n + j], grid[i][j]);
                dp(counts[i * n + j - 1], counts[i * n + j], grid[i][j]);
            }
        }

        return counts[m * n - 1].count(0) != 0;
    }

    void dp(unordered_set<int>& prev, unordered_set<int>& current, char c) {
        if (c == '(') {
            for (int num : prev) {
                current.insert(num + 1);
            }
        }
        else {
            for (int num : prev) {
                if (num != 0) {
                    current.insert(num - 1);
                }
            }
        }
    }
};

int main()
{
    CheckResult check;
    Solution o;

    vector<vector<char>> grid = { {'(','(','('},{')','(',')'},{'(','(',')'},{'(','(',')'} };
    check.checkBool(true, o.hasValidPath(grid));
    
    grid = { {'(','(','(','(','(',')',')','(',')',')','(',')',')','(',')','(','(',')',')','(',')','(',')',')','(',')',')',')',')','(',')','(','('},{'(',')',')','(','(',')',')',')',')','(',')','(',')','(',')','(','(',')',')','(','(','(','(',')',')',')',')',')','(','(',')','(','('},{')',')','(','(',')',')',')',')','(',')','(',')',')',')','(','(',')','(',')','(','(','(',')',')',')',')',')',')',')',')',')','(','('},{'(','(','(',')','(',')',')',')','(',')','(','(','(',')','(',')','(',')','(',')','(',')','(',')',')',')','(','(',')','(',')',')',')'},{')','(',')','(',')',')',')',')','(','(','(','(',')','(',')','(','(','(','(','(',')','(','(',')',')','(','(','(',')','(',')',')','('},{')',')',')','(',')',')',')','(','(',')',')','(','(','(','(',')','(','(',')',')','(',')',')',')','(',')',')','(',')',')','(','(','('},{')','(',')','(','(',')',')','(',')',')',')','(','(','(',')','(','(','(',')','(',')','(',')',')',')',')',')','(',')',')','(','(',')'},{'(','(',')',')','(',')',')','(','(','(','(',')','(',')','(','(','(','(','(','(',')','(',')','(',')',')','(','(','(',')','(','(',')'},{')',')','(','(',')',')','(','(','(','(','(','(','(',')',')','(','(','(',')',')','(',')','(','(',')',')','(',')',')','(',')','(','('},{')',')',')',')','(',')',')','(','(','(','(',')',')',')','(',')',')',')',')',')',')','(','(','(','(',')',')',')',')','(','(','(',')'} };
    check.checkBool(true, o.hasValidPath(grid));

    grid = { {')',')'},{'(','('} };
    check.checkBool(false, o.hasValidPath(grid));

    grid = { {'(','('} };
    check.checkBool(false, o.hasValidPath(grid));
}

// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门使用技巧: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
